app/controllers/api/v1/auth_controller.rb

    def show
        user = User.find_by(id: user_id)
---
SELECT "users".* FROM "users" WHERE "users"."id" = $1 LIMIT $2  [["id", 6], ["LIMIT", 1]]