app/controllers/api/v1/interests_controller.rb

SELECT "interests".* FROM "interests"
---
    def index
        interests = Interest.all