app/controllers/api/v1/users_controller.rb

    def create
        @user = User.create(user_params)
---
INSERT INTO "users" ("first_name", "last_name", "username", "password_digest", "email", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6, $7) RETURNING "id"

    def set_user
        @user = User.find_by(id: params[:id])
---
SELECT "users".* FROM "users" WHERE "users"."id" = $1 LIMIT $2  [["id", nil], ["LIMIT", 1]]